### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

## merge

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

<img src="https://miro.medium.com/max/1400/1*ZCpo3gXuXI4KFhKivEt2ZA.png" width="600">

- merge(데이터프레임1, 데이터프레임2) : 두 데이터프레임에 동일한 이름을 가진 컬럼을 기준으로 두 데이터프레임을 합침

<img src='https://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png?ezimgfmt=ng:webp/ngcb1'>

In [1]:
import pandas as pd

In [ ]:
pd.merge?

In [15]:
df1 = pd.DataFrame(
    {
        "x1" : ["A","B","C"],
        "x2":[1,2,3]
    }
)
df1

  x1  x2
0  A   1
1  B   2
2  C   3

In [18]:
df2 = pd.DataFrame(
    {
        "x1" : ["A","B","D"],
        "x2":["T","S","T"]
    }
)
df2

  x1 x2
0  A  T
1  B  S
2  D  T

In [12]:
pd.merge(df1,df2,on="x1")

  x1  x2_x x2_y
0  A     1    T
1  B     6    S
2  C     3    T

In [19]:
pd.merge(df1,df2,on="x1",how="outer")

  x1  x2_x x2_y
0  A   1.0    T
1  B   2.0    S
2  C   3.0  NaN
3  D   NaN    T

In [20]:
pd.merge(left=df1,right=df2,on="x1",how="left")

  x1  x2_x x2_y
0  A     1    T
1  B     2    S
2  C     3  NaN

In [21]:
df1.x1

0    A
1    B
2    C
Name: x1, dtype: object

In [22]:
df2.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [30]:
df1[df1["x1"].isin(df2.x1)]

  x1  x2
0  A   1
1  B   2

In [31]:
# ~ : 제외

df1[~df1["x1"].isin(df2.x1)]

  x1  x2
2  C   3